WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/include/board.h
/* AHB clock (HCLK) is SYSCLK (216 MHz) */

#define STM32_RCC_CFGR_HPRE     RCC_CFGR_HPRE_SYSCLK  /* HCLK  = SYSCLK / 1 */
#define STM32_HCLK_FREQUENCY    STM32_SYSCLK_FREQUENCY
#define STM32_BOARD_HCLK        STM32_HCLK_FREQUENCY  /* same as above, to satisfy compiler */

#define BOARD_AHB_FREQUENCY     STM32_HCLK_FREQUENCY

/* APB1 clock (PCLK1) is HCLK/4 (54 MHz) */

#define STM32_RCC_CFGR_PPRE1    RCC_CFGR_PPRE1_HCLKd4     /* PCLK1 = HCLK / 4 */
#define STM32_PCLK1_FREQUENCY   (STM32_HCLK_FREQUENCY/4)

/* Timers driven from APB1 will be twice PCLK1 */

#define STM32_APB1_TIM2_CLKIN   (2*STM32_PCLK1_FREQUENCY)
#define STM32_APB1_TIM3_CLKIN   (2*STM32_PCLK1_FREQUENCY)
#define STM32_APB1_TIM4_CLKIN   (2*STM32_PCLK1_FREQUENCY)
#define STM32_APB1_TIM5_CLKIN   (2*STM32_PCLK1_FREQUENCY)
#define STM32_APB1_TIM6_CLKIN   (2*STM32_PCLK1_FREQUENCY)
#define STM32_APB1_TIM7_CLKIN   (2*STM32_PCLK1_FREQUENCY)
#define STM32_APB1_TIM12_CLKIN  (2*STM32_PCLK1_FREQUENCY)
#define STM32_APB1_TIM13_CLKIN  (2*STM32_PCLK1_FREQUENCY)
#define STM32_APB1_TIM14_CLKIN  (2*STM32_PCLK1_FREQUENCY)

/* APB2 clock (PCLK2) is HCLK/2 (108MHz) */

#define STM32_RCC_CFGR_PPRE2    RCC_CFGR_PPRE2_HCLKd2     /* PCLK2 = HCLK / 2 */
#define STM32_PCLK2_FREQUENCY   (STM32_HCLK_FREQUENCY/2)

/* Timers driven from APB2 will be twice PCLK2 */

#define STM32_APB2_TIM1_CLKIN   (2*STM32_PCLK2_FREQUENCY)
#define STM32_APB2_TIM8_CLKIN   (2*STM32_PCLK2_FREQUENCY)
#define STM32_APB2_TIM9_CLKIN   (2*STM32_PCLK2_FREQUENCY)
#define STM32_APB2_TIM10_CLKIN  (2*STM32_PCLK2_FREQUENCY)
#define STM32_APB2_TIM11_CLKIN  (2*STM32_PCLK2_FREQUENCY)

/* FLASH wait states
 *
 *  --------- ---------- -----------
 *  VDD       MAX SYSCLK WAIT STATES
 *  --------- ---------- -----------
 *  1.7-2.1 V   180 MHz    8
 *  2.1-2.4 V   216 MHz    9
 *  2.4-2.7 V   216 MHz    8
 *  2.7-3.6 V   216 MHz    7
 *  --------- ---------- -----------
 */

#define BOARD_FLASH_WAITSTATES 7

/* LED definitions ******************************************************************/
/* The STM32F777ZIT6-MEADOW board */

/* LED index values for use with board_userled() */

#define BOARD_LED1        0
#define BOARD_LED2        1
#define BOARD_LED3        2
#define BOARD_NLEDS       3

#define BOARD_LED_GREEN   BOARD_LED1
#define BOARD_LED_BLUE    BOARD_LED2
#define BOARD_LED_RED     BOARD_LED3

/* LED bits for use with board_userled_all() */

#define BOARD_LED1_BIT    (1 << BOARD_LED1)
#define BOARD_LED2_BIT    (1 << BOARD_LED2)
#define BOARD_LED3_BIT    (1 << BOARD_LED3)

/* If CONFIG_ARCH_LEDS is defined, the usage by the board port is defined in
 * include/board.h and src/stm32_leds.c. The LEDs are used to encode OS-related
 * events as follows:
 *
 *   SYMBOL              Meaning                 LD1
 *   ------------------- ----------------------- ------
 *   LED_STARTED         NuttX has been started  OFF
 *   LED_HEAPALLOCATE    Heap has been allocated OFF
 *   LED_IRQSENABLED     Interrupts enabled      OFF
 *   LED_STACKCREATED    Idle stack created      ON
 *   LED_INIRQ           In an interrupt         N/C
 *   LED_SIGNAL          In a signal handler     N/C
 *   LED_ASSERTION       An assertion failed     N/C
 *   LED_PANIC           The system has crashed  FLASH
 *
 * Thus is LD1 is statically on, NuttX has successfully  booted and is,
 * apparently, running normally.  If LD1 is flashing at approximately
 * 2Hz, then a fatal error has been detected and the system has halted.
 */

#define LED_STARTED        0 /* NuttX has been started   OFF    OFF   OFF  */
#define LED_HEAPALLOCATE   1 /* Heap has been allocated  OFF    OFF   ON   */
#define LED_IRQSENABLED    2 /* Interrupts enabled       OFF    ON    OFF  */
#define LED_STACKCREATED   3 /* Idle stack created       OFF    ON    ON   */
#define LED_INIRQ          4 /* In an interrupt          N/C    N/C   GLOW */
#define LED_SIGNAL         5 /* In a signal handler      N/C    GLOW  N/C  */
#define LED_ASSERTION      6 /* An assertion failed      GLOW   N/C   GLOW */
#define LED_PANIC          7 /* The system has crashed   Blink  OFF   N/C  */
#define LED_IDLE           8 /* MCU is is sleep mode     ON     OFF   OFF  */

/* Button definitions ***************************************************************/
/* The STM32F7 Discovery supports one button:  Pushbutton B1, labelled "User", is
 * connected to GPIO PA0.  A high value will be sensed when the button is depressed.
 */

#define BUTTON_USER        0
#define NUM_BUTTONS        1
#define BUTTON_USER_BIT    (1 << BUTTON_USER)

/* Meadow ESP32 Boot and Reset pin connections **************************************/

// GPIO_FLOAT because on board resistors pull up
#define MEADOW_ESP32_ONBOARD_BOOT_PIN_OUTPUT  (GPIO_OUTPUT | GPIO_FLOAT | GPIO_OPENDRAIN | GPIO_SPEED_100MHz | GPIO_PORTI | GPIO_PIN10)
#define MEADOW_ESP32_ONBOARD_RESET_PIN_OUTPUT (GPIO_OUTPUT | GPIO_FLOAT | GPIO_OPENDRAIN | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN7)

#define MEADOW_ESP32_ONBOARD_RESET_PIN_INPUT  (GPIO_INPUT | GPIO_FLOAT | GPIO_SPEED_100MHz | GPIO_PORTF | GPIO_PIN7)
#define MEADOW_ESP32_ONBOARD_BOOT_PIN_INPUT   (GPIO_INPUT | GPIO_FLOAT | GPIO_SPEED_100MHz | GPIO_PORTI | GPIO_PIN10)

/* Alternate function pin selections ************************************************/

// Note: The source defns are from \arch\arm\src\stm32f7\chip\stm32f76xx77xx_pinmap.h

// USART1 (Meadow COM1) (optional syslog output)
#define GPIO_USART1_RX GPIO_USART1_RX_3 // PB15
#define GPIO_USART1_TX GPIO_USART1_TX_3 // PB14

// UART4 (Meadow COM4) (optional syslog output)
#define GPIO_UART4_RX GPIO_UART4_RX_6 // PI9
#define GPIO_UART4_TX GPIO_UART4_TX_5 // PH13

// UART5 (Meadow STM32F7 to ESP32)
#define GPIO_UART5_RX     GPIO_UART5_RX_1 // PD2
// Left the original '#define GPIO_UART5_TX' so modifying Nuttx code not needed
#define GPIO_UART5_TX     GPIO_UART5_TX_3 // PB13 - default
#define GPIO_UART5_TX_V1  GPIO_UART5_TX_3 // PB13 - F7v1
#define GPIO_UART5_TX_V2  GPIO_UART5_TX_1 // PC12 - F7v2 & CCMv2

// UART6 (optional syslog output)
// F7v1 and F7v2 both exposed UART6 but on different pins
// F7v1 pins USART6_TX = D02 and USART6_RX = D05
// F7v2 pins USART6_TX = D09 and USART6_RX = D10
#define GPIO_USART6_RX GPIO_USART6_RX_1 // PC7
#define GPIO_USART6_TX GPIO_USART6_TX_1 // PC6

// Used to reconfigure F7's NJTRST pin as a non-debug GPIO at startup
#define MEADOW_DEBUG_NJTRST_NOT_USED_GPIO     (GPIO_INPUT | GPIO_FLOAT | GPIO_SPEED_100MHz | GPIO_PORTB | GPIO_PIN4)

/* PWM
 */

#define GPIO_TIM2_CH1OUT  GPIO_TIM2_CH1OUT_1
#define GPIO_TIM2_CH2OUT  GPIO_TIM2_CH2OUT_1
#define GPIO_TIM2_CH3OUT  GPIO_TIM2_CH3OUT_1
#define GPIO_TIM3_CH2OUT  GPIO_TIM3_CH2OUT_3
#define GPIO_TIM3_CH3OUT  GPIO_TIM3_CH3OUT_1
#define GPIO_TIM3_CH4OUT  GPIO_TIM3_CH4OUT_1
#define GPIO_TIM4_CH1OUT  GPIO_TIM4_CH1OUT_1
#define GPIO_TIM4_CH2OUT  GPIO_TIM4_CH2OUT_1
#define GPIO_TIM4_CH3OUT  GPIO_TIM4_CH3OUT_1
#define GPIO_TIM4_CH4OUT  GPIO_TIM4_CH4OUT_1
#define GPIO_TIM5_CH1OUT  GPIO_TIM5_CH1OUT_2
#define GPIO_TIM8_CH1OUT  GPIO_TIM8_CH1OUT_1
#define GPIO_TIM8_CH4OUT  GPIO_TIM8_CH4OUT_1
#define GPIO_TIM9_CH2OUT  GPIO_TIM9_CH2OUT_1
#define GPIO_TIM12_CH1OUT  GPIO_TIM12_CH1OUT_1
#define GPIO_TIM12_CH2OUT  GPIO_TIM12_CH2OUT_1
#define GPIO_TIM14_CH1OUT  GPIO_TIM14_CH1OUT_1


/* The STM32 F7 connects to a SMSC LAN8742A PHY using these pins:
 *
 *   STM32 F7  BOARD        LAN8742A
 *   GPIO      SIGNAL       PIN NAME
 *   --------- ------------ -------------
 *   PG11/PB11 RMII_TX_EN   TXEN
 *   PG13      RMII_TXD0    TXD0
 *   PG14      RMII_TXD1    TXD1
 *   PC4       RMII_RXD0    RXD0/MODE0
 *   PC5       RMII_RXD1    RXD1/MODE1
 *   PD5       RMII_RXER    RXER/PHYAD0
 *   PA7       RMII_CRS_DV  CRS_DV/MODE2
 *   PC1       RMII_MDC     MDC
 *   PA2       RMII_MDIO    MDIO
 *   N/A       NRST         nRST
 *   PA1       RMII_REF_CLK nINT/REFCLK0
 *   N/A       OSC_25M      XTAL1/CLKIN
 *
 * The PHY address is 0, since RMII_RXER/PHYAD0 features a pull down.
 * After reset, RMII_RXER/PHYAD0 switches to the RXER function,
 * receive errors can be detected using GPIO pin PD5
 */

// These are the only GPIOs define here because they are the only ones
// that have more that one GPIO option.The other 6 RMII GPIOs are
// fixed by the STM32F777.
// However, There was a F7v1 embedded board followed by a F7v2 Core-Compute
// Module (CCM). The F7v1 version never shipped to customers but was the first
// one to work with Ethernet. The F7v1 version used PG11 for RMMI_TX_EN and
// The CCM used PB11. Therefore, the following will not be necessary in the
// future, F7v2 uses PB11.
#define GPIO_ETH_RMII_TX_EN   GPIO_ETH_RMII_TX_EN_1 // PB11 F7v2
// #define GPIO_ETH_RMII_TX_EN   GPIO_ETH_RMII_TX_EN_2 // PG11 F7v1
#define GPIO_ETH_RMII_TXD0    GPIO_ETH_RMII_TXD0_2  // PG13
#define GPIO_ETH_RMII_TXD1    GPIO_ETH_RMII_TXD1_2  // PG14

/* I2C Mapping
 * I2C #4 is connected to the LCD daughter board
 * and the WM8994 audio codec.
 *
 * I2C4_SCL - PD12
 * I2C4_SDA - PB7
 */
#define GPIO_I2C4_SCL        GPIO_I2C4_SCL_1
#define GPIO_I2C4_SDA        GPIO_I2C4_SDA_5


/* QSPI Mapping  */

