WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/include/board.h
#define GPIO_QSPI_CS  (GPIO_QUADSPI_BK1_NCS_2 | GPIO_FLOAT | GPIO_PUSHPULL | GPIO_SPEED_100MHz)
#define GPIO_QSPI_IO0 (GPIO_QUADSPI_BK1_IO0_3 | GPIO_FLOAT | GPIO_PUSHPULL | GPIO_SPEED_100MHz)
#define GPIO_QSPI_IO1 (GPIO_QUADSPI_BK1_IO1_3 | GPIO_FLOAT | GPIO_PUSHPULL | GPIO_SPEED_100MHz)
#define GPIO_QSPI_IO2 (GPIO_QUADSPI_BK1_IO2_1 | GPIO_FLOAT | GPIO_PUSHPULL | GPIO_SPEED_100MHz)
#define GPIO_QSPI_IO3 (GPIO_QUADSPI_BK1_IO3_2 | GPIO_FLOAT | GPIO_PUSHPULL | GPIO_SPEED_100MHz)
#define GPIO_QSPI_SCK (GPIO_QUADSPI_CLK_1     | GPIO_FLOAT | GPIO_PUSHPULL | GPIO_SPEED_100MHz)

/* SDMMC */

/* Stream selections are arbitrary for now but might become important in the future
 * if we set aside more DMA channels/streams.
 *
 * THE FOLLOWING ARE WRONG FOR F7. Issue written (PWM 5Feb23)
 * SDIO DMA
 *   DMAMAP_SDMMC1_1 = Channel 4, Stream 3
 *   DMAMAP_SDMMC1_2 = Channel 4, Stream 6
 *
 *   DMAMAP_SDMMC2_1 = Channel 11, Stream 0
 *   DMAMAP_SDMMC2_2 = Channel 11, Stream 5
 */

// #define DMAMAP_SDMMC1  DMAMAP_SDMMC1_1
#define DMAMAP_SDMMC2  DMAMAP_SDMMC2_1

/* SDIO dividers.  Note that slower clocking is required when DMA is disabled
 * in order to avoid RX overrun/TX underrun errors due to delayed responses
 * to service FIFOs in interrupt driven mode.  These values have not been
 * tuned!!!
 *
 * SDIOCLK=48MHz, SDIO_CK=SDIOCLK/(118+2)=400 KHz
 */

#define STM32_SDMMC_INIT_CLKDIV      (118 << STM32_SDMMC_CLKCR_CLKDIV_SHIFT)

/* DMA ON:  SDIOCLK=48MHz, SDIO_CK=SDIOCLK/(1+2)=16 MHz
 * DMA OFF: SDIOCLK=48MHz, SDIO_CK=SDIOCLK/(2+2)=12 MHz
 */

#ifdef CONFIG_SDIO_DMA
#  define STM32_SDMMC_MMCXFR_CLKDIV  (1 << STM32_SDMMC_CLKCR_CLKDIV_SHIFT)
#else
#  define STM32_SDMMC_MMCXFR_CLKDIV  (2 << STM32_SDMMC_CLKCR_CLKDIV_SHIFT)
#endif

/* DMA ON:  SDIOCLK=48MHz, SDIO_CK=SDIOCLK/(1+2)=16 MHz
 * DMA OFF: SDIOCLK=48MHz, SDIO_CK=SDIOCLK/(2+2)=12 MHz
 */

#ifdef CONFIG_SDIO_DMA
#  define STM32_SDMMC_SDXFR_CLKDIV   (1 << STM32_SDMMC_CLKCR_CLKDIV_SHIFT)
#else
#  define STM32_SDMMC_SDXFR_CLKDIV   (2 << STM32_SDMMC_CLKCR_CLKDIV_SHIFT)
#endif

/* SDMMC2 Pin mapping
 *
 * D0 - PB14 or PG9
 * D1 - PB15 or PG10
 * D2 - PB3 or PG11
 * D3 - PB4 or PG12
 */
#define GPIO_SDMMC2_D0  GPIO_SDMMC2_D0_2  // PG9
#define GPIO_SDMMC2_D1  GPIO_SDMMC2_D1_2  // PG10
#define GPIO_SDMMC2_D2  GPIO_SDMMC2_D2_2  // PG11
#define GPIO_SDMMC2_D3  GPIO_SDMMC2_D3_2  // PG12

// SDCard present detection pin (CCM v2a this is CCM pin 28, PG6)
#define GPIO_MEADOW_SDIO_NCD  (GPIO_INPUT|GPIO_PULLUP|GPIO_EXTI|GPIO_PORTG|GPIO_PIN6)

/* FMC - SDRAM */

#define GPIO_FMC_SDCKE1 GPIO_FMC_SDCKE1_1
#define GPIO_FMC_SDNE1  GPIO_FMC_SDNE1_1
#define GPIO_FMC_SDNWE  GPIO_FMC_SDNWE_1

/* LCD DISPLAY
 * (work in progress as of 2017 07 19)
 */
#define	BOARD_LTDC_WIDTH        800
#define	BOARD_LTDC_HEIGHT       472

#define	BOARD_LTDC_HSYNC        10
#define	BOARD_LTDC_HFP          10
#define	BOARD_LTDC_HBP          20
#define	BOARD_LTDC_VSYNC        2
#define	BOARD_LTDC_VFP          4
#define	BOARD_LTDC_VBP          2

#define	BOARD_LTDC_GCR_PCPOL    0
#define	BOARD_LTDC_GCR_DEPOL    0
#define	BOARD_LTDC_GCR_VSPOL    0
#define	BOARD_LTDC_GCR_HSPOL    0

// Meadow feather exposes only 1 I2C bus.  It's on D07 (SDA) and D08 (SCL)
#define GPIO_I2C1_SCL  GPIO_I2C1_SCL_1
#define GPIO_I2C1_SDA  GPIO_I2C1_SDA_1
//meadow core compute has an additional I2C
#define GPIO_I2C3_SCL  GPIO_I2C3_SCL_2
#define GPIO_I2C3_SDA  GPIO_I2C3_SDA_2

//#define GPIO_I2C1_SCL   GPIO_I2C4_SCL_5
//#define GPIO_I2C1_SDA   GPIO_I2C4_SDA_4

#define CONFIG_STM32F7_I2CTIMEOSEC 0     /* 0 seconds */
#define CONFIG_STM32F7_I2CTIMEOMS  500   /* plus 500 milliseconds */

// #define	BOARD_LTDC_OUTPUT_BPP   16

//#define	BOARD_LTDC_GCR_DEN
//#define	BOARD_LTDC_GCR_DBW
//#define	BOARD_LTDC_GCR_DGW
//#define	BOARD_LTDC_GCR_DRW

#define GPIO_SPI_CS    (GPIO_OUTPUT | GPIO_PUSHPULL | GPIO_SPEED_50MHz | \
                        GPIO_OUTPUT_SET)

#define GPIO_SPI5_SCK         (GPIO_ALT|GPIO_AF5|GPIO_SPEED_50MHz|GPIO_PORTH|GPIO_PIN6)
#define GPIO_SPI5_MISO        (GPIO_ALT|GPIO_AF5|GPIO_SPEED_50MHz|GPIO_PORTF|GPIO_PIN8)
#define GPIO_SPI5_MOSI        (GPIO_ALT|GPIO_AF5|GPIO_SPEED_50MHz|GPIO_PORTF|GPIO_PIN9)

#define GPIO_SPI3_SCK         (GPIO_ALT|GPIO_AF6|GPIO_SPEED_50MHz|GPIO_PORTC|GPIO_PIN10)
#define GPIO_SPI3_MISO        (GPIO_ALT|GPIO_AF6|GPIO_SPEED_50MHz|GPIO_PORTC|GPIO_PIN11)
#define GPIO_SPI3_MOSI        (GPIO_ALT|GPIO_AF6|GPIO_SPEED_50MHz|GPIO_PORTB|GPIO_PIN5)

#define GPIO_SPI2_CS          (GPIO_SPI_CS | GPIO_PORTI | GPIO_PIN0)
#define GPIO_SPI2_SCK         GPIO_SPI2_SCK_4
#define GPIO_SPI2_MISO        GPIO_SPI2_MISO_3
#define GPIO_SPI2_MOSI        GPIO_SPI2_MOSI_3

// Meadow uses 3 SPI devices SPI2, SPI3 and SPI5
// SPI2 only has one option for RX and TX this is baked into stm32_spi.c
// #define DMAMAP_SPI2_RX             STM32_DMA_MAP(DMA1,DMA_STREAM3,DMA_CHAN0)
// #define DMAMAP_SPI2_TX             STM32_DMA_MAP(DMA1,DMA_STREAM4,DMA_CHAN0)

// Mapping for SPI3.
// #define DMAMAP_SPI3_RX_1  STM32_DMA_MAP(DMA1,DMA_STREAM0,DMA_CHAN0)
// #define DMAMAP_SPI3_TX_1  STM32_DMA_MAP(DMA1,DMA_STREAM5,DMA_CHAN0)
// #define DMAMAP_SPI3_RX_2  STM32_DMA_MAP(DMA1,DMA_STREAM2,DMA_CHAN0)
// #define DMAMAP_SPI3_TX_2  STM32_DMA_MAP(DMA1,DMA_STREAM7,DMA_CHAN0)
#define DMAMAP_SPI3_RX  DMAMAP_SPI3_RX_2
#define DMAMAP_SPI3_TX  DMAMAP_SPI3_TX_2

// Mapping for SPI5, Note uses DMA2 mapping
// #define DMAMAP_SPI5_RX_1  STM32_DMA_MAP(DMA2,DMA_STREAM3,DMA_CHAN2)
// #define DMAMAP_SPI5_TX_1  STM32_DMA_MAP(DMA2,DMA_STREAM4,DMA_CHAN2)
// #define DMAMAP_SPI5_RX_2  STM32_DMA_MAP(DMA2,DMA_STREAM5,DMA_CHAN7)
// #define DMAMAP_SPI5_TX_2  STM32_DMA_MAP(DMA2,DMA_STREAM6,DMA_CHAN7)
// #define DMAMAP_SPI5_RX_3  STM32_DMA_MAP(DMA2,DMA_STREAM5,DMA_CHAN9)
#define DMAMAP_SPI5_RX  DMAMAP_SPI5_RX_1
#define DMAMAP_SPI5_TX  DMAMAP_SPI5_TX_1

/************************************************************************************
 * Public Data
 ************************************************************************************/
#ifndef __ASSEMBLY__

#undef EXTERN
#if defined(__cplusplus)
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

/************************************************************************************
 * Public Function Prototypes
 ************************************************************************************/

/************************************************************************************
 * Name: stm32_boardinitialize
 *
 * Description:
 *   All STM32 architectures must provide the following entry point.  This entry point
 *   is called early in the initialization -- after all memory has been configured
 *   and mapped but before any devices have been initialized.
 *
 ************************************************************************************/

void stm32_boardinitialize(void);

#undef EXTERN
#if defined(__cplusplus)
}
#endif

#endif /* __ASSEMBLY__ */
#endif  /* __CONFIG_STM32F777ZIT6_MEADOW_INCLUDE_BOARD_H */
